; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=14, remove_proportion=0.2, bases=2, instance_id=4, output=./training, seed=45

(define (problem warehouse-04)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 - box
        base1 base2 - base
    )
    (:init
        (to-remove box5)
        (to-remove box7)
        (clear box14)
        (on box14 box12)
        (on box12 box9)
        (on box9 box7)
        (on box7 box6)
        (on box6 box3)
        (on box3 box10)
        (on-base box10 base1)
        (clear box8)
        (on box8 box13)
        (on box13 box4)
        (on box4 box1)
        (on box1 box5)
        (on box5 box11)
        (on box11 box2)
        (on-base box2 base2)
    )
    (:goal (and 
        (removed box5)
        (removed box7)
    ))
)

; plan
1. (move box14 box12 box8)
   deleted: (clear box8) (on box14 box12)
   added: (on box14 box8) (clear box12)
   goals met: 0 of 2
2. (move box12 box9 box14)
   deleted: (clear box14) (on box12 box9)
   added: (on box12 box14) (clear box9)
   goals met: 0 of 2
3. (move box9 box7 box12)
   deleted: (clear box12) (on box9 box7)
   added: (on box9 box12) (clear box7)
   goals met: 0 of 2
4. (remove box7 box6)
   deleted: (on box7 box6) (clear box7)
   added: (removed box7) (clear box6)
   goals met: 1 of 2
5. (move box9 box12 box6)
   deleted: (clear box6) (on box9 box12)
   added: (on box9 box6) (clear box12)
   goals met: 1 of 2
6. (move box12 box14 box9)
   deleted: (clear box9) (on box12 box14)
   added: (on box12 box9) (clear box14)
   goals met: 1 of 2
7. (move box14 box8 box12)
   deleted: (clear box12) (on box14 box8)
   added: (on box14 box12) (clear box8)
   goals met: 1 of 2
8. (move box8 box13 box14)
   deleted: (clear box14) (on box8 box13)
   added: (on box8 box14) (clear box13)
   goals met: 1 of 2
9. (move box13 box4 box8)
   deleted: (clear box8) (on box13 box4)
   added: (on box13 box8) (clear box4)
   goals met: 1 of 2
10. (move box4 box1 box13)
   deleted: (clear box13) (on box4 box1)
   added: (on box4 box13) (clear box1)
   goals met: 1 of 2
11. (move box1 box5 box4)
   deleted: (clear box4) (on box1 box5)
   added: (on box1 box4) (clear box5)
   goals met: 1 of 2
12. (remove box5 box11)
   deleted: (on box5 box11) (clear box5)
   added: (removed box5) (clear box11)
   goals met: 2 of 2
